//Какое будет выведено значение: let x = 5; alert( x++ );
//Будет выведено 5, тк сначала значение выводится, а только потом увеличивается

//Чему равно такое выражение: [ ] + false - null + true
//Выражение будет равно NaN

//let y = 1; let x = y = 2; alert(x);
//Код выведет 2

//Чему равна сумма [ ] + 1 + 2
//Сумма будет равна 12

//Что выведет этот код: alert( "1"[0] )
//Код выведет 1

//Чему равно 2 && 1 && null && 0 && undefined
//Выражение равно null 

//Есть ли разница между выражениями? !!( a && b ) и (a && b)
//Да, слева будет булево значение, а справа может быть любое

//Что выведет этот код: alert( null || 2 && 3 || 4 );
//Код выведет 3

//a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b
//нет, объекты не равны  

//Что выведет этот код: alert( +"Infinity" );
//Выведет Infinity 

//Верно ли сравнение: "ёжик" > "яблоко"
//да, верно, тк ё больше чем я 

//Чему равно 0 || "" || 2 || undefined || true || falsе
//Выражение равно 2
